experiments/results/ofa23/nulldev/fio_randwrite_32k_2_2.out
randwrite_32k_2_2: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=io_uring, iodepth=2
...
fio-3.28
Starting 2 threads

randwrite_32k_2_2: (groupid=0, jobs=2): err= 0: pid=22719: Thu Apr  6 14:19:20 2023
  write: IOPS=49.9k, BW=1560MiB/s (1636MB/s)(91.4GiB/60001msec); 0 zone resets
    slat (usec): min=4, max=153, avg= 6.69, stdev= 1.21
    clat (nsec): min=581, max=1751.2k, avg=72746.74, stdev=13836.05
     lat (usec): min=61, max=1757, avg=79.52, stdev=13.92
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   68], 10.00th=[   68], 20.00th=[   69],
     | 30.00th=[   69], 40.00th=[   70], 50.00th=[   70], 60.00th=[   70],
     | 70.00th=[   71], 80.00th=[   72], 90.00th=[   78], 95.00th=[  110],
     | 99.00th=[  135], 99.50th=[  139], 99.90th=[  151], 99.95th=[  155],
     | 99.99th=[  192]
   bw (  MiB/s): min= 1243, max= 1570, per=100.00%, avg=1560.43, stdev=14.87, samples=240
   iops        : min=39800, max=50256, avg=49933.53, stdev=475.93, samples=240
  lat (nsec)   : 750=0.01%
  lat (usec)   : 50=0.01%, 100=94.85%, 250=5.15%, 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=5.33%, sys=22.11%, ctx=2985641, majf=0, minf=0
  IO depths    : 1=0.0%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2995555,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=1560MiB/s (1636MB/s), 1560MiB/s-1560MiB/s (1636MB/s-1636MB/s), io=91.4GiB (98.2GB), run=60001-60001msec